the4lchemist/PSoC5LP_MegaDrive_player/SoundTest.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "YM_MOL_aliases.h"
#include "YM_MOL.h"
#include "YM_MOR_aliases.h"
#include "YM_MOR.h"
#include "YM_A1_aliases.h"
#include "YM_A1.h"
#include "YM_A0_aliases.h"
#include "YM_A0.h"
#include "YM_CLK_aliases.h"
#include "YM_CLK.h"
#include "YM_RD_aliases.h"
#include "YM_RD.h"
#include "YM_WR_aliases.h"
#include "YM_WR.h"
#include "YM_CS_aliases.h"
#include "YM_CS.h"
#include "YM_Data_aliases.h"
#include "YM_Data.h"
#include "Clock_3.h"
#include "isr_1.h"
#include "SN_CLK_aliases.h"
#include "SN_CLK.h"
#include "SN_OUT_aliases.h"
#include "SN_OUT.h"
#include "SN_WE_aliases.h"
#include "SN_WE.h"
#include "YM_IC_aliases.h"
#include "YM_IC.h"
#include "Clock_1.h"
#include "Clock_2.h"
#include "Opamp_1.h"
#include "Vout_1_aliases.h"
#include "Vout_1.h"
#include "Opamp_2.h"
#include "Vout_2_aliases.h"
#include "Vout_2.h"
#include "Opamp_3.h"
#include "Vout_3_aliases.h"
#include "Vout_3.h"
#include "cy_em_eeprom.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"

/*[]*/

